In [1]:
import pandas as pd
import numpy as np
import scipy.stats as stats
from pydataset import data

In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [11]:
df_iris = data('iris')

In [13]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [15]:
df_iris.shape

(150, 5)

In [17]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [19]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [22]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read the data from this google sheet into a dataframe, df_google.

In [74]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [75]:
df_google = pd.read_csv(csv_export_url)

In [77]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [79]:
df_google.shape

(891, 12)

In [81]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [83]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [85]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [92]:
df_google.dtypes[df_google.dtypes == object]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [101]:
for i in df_google.dtypes[df_google.dtypes == object].index:
    print(i)

Name
Sex
Ticket
Cabin
Embarked

In [102]:
df_google[['Name','Sex', 'Ticket', 'Cabin', 'Embarked']].value_counts()

Name                                Sex     Ticket    Cabin  Embarked
Allen, Miss. Elisabeth Walton       female  24160     B5     S           1
Newsom, Miss. Helen Monypeny        female  11752     D47    S           1
Molson, Mr. Harry Markland          male    113787    C30    S           1
Moor, Master. Meier                 male    392096    E121   S           1
Moor, Mrs. (Beila)                  female  392096    E121   S           1
                                                                        ..
Frolicher, Miss. Hedwig Margaritha  female  13568     B39    C           1
Frolicher-Stehli, Mr. Maxmillian    male    13567     B41    C           1
Fry, Mr. Richard                    male    112058    B102   S           1
Futrelle, Mr. Jacques Heath         male    113803    C123   S           1
Young, Miss. Marie Grice            female  PC 17760  C32    C           1
Length: 202, dtype: int64

Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [8]:
file_path = '/Users/aaron/codeup-data-science/classification-exercises/train.xlsx'

In [11]:
df_excel = pd.read_excel(file_path)

In [13]:
df_excel_sample = df_excel.head(100)

In [15]:
df_excel.shape[0]

891

In [17]:
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [27]:
df_excel.dtypes[df_excel.dtypes == object]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [37]:
df_excel.describe().loc[['min', 'max']]

     PassengerId  Survived  Pclass    Age  SibSp  Parch      Fare
min          1.0       0.0     1.0   0.42    0.0    0.0    0.0000
max        891.0       1.0     3.0  80.00    8.0    6.0  512.3292

## Acquire.py info

In [48]:
import env
import os

In [52]:
def get_titanic_data():
    '''
    This function returns the passengers table from the titanic db. 
    This funcction requires the user to have an env.py file with a 
    function to create a MySQL url without user input from this module.
    '''
    filename = "titanic.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else: 
        db = ('titanic_db')
        query = 'SELECT * FROM passengers;'
        url = env.get_db_url(db)
        return pd.read_sql(query, url)

In [45]:
db = ('titanic_db')
query = 'SELECT * FROM passengers;'
url = env.get_db_url(db)
pd.read_sql(query, url)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,None,Queenstown,1

In [51]:
def get_iris_data():
    '''
    This function returns the species table from the iris_db. 
    No arguments are needed for it run
    '''
    filename = 'iris.csv'
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else: 
        db = ('iris_db')
        query = 'SELECT * FROM species;'
        url = env.get_db_url(db)
        return pd.read_sql(query, url)

In [58]:
def get_telco_data():
    '''
    This function a dataframe containing all the contract, payment, and internet service options for each customer.
    '''
    filename = 'telco.csv'
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        db = 'telco_churn'
        url = env.get_db_url(db)
        query = '''SELECT *
            FROM customers c
            JOIN customer_contracts cc ON c.customer_id = cc.customer_id
            JOIN contract_types ct ON cc.contract_type_id = ct.contract_type_id
            JOIN internet_service_types ist ON c.internet_service_type_id = ist.internet_service_type_id
            JOIN customer_payments cp ON c.customer_id = cp.customer_id
            JOIN payment_types pt ON cp.payment_type_id = pt.payment_type_id;'''
        return pd.read_sql(query, url)

In [66]:
df_iris = get_iris_data()

In [69]:
df_iris.head()

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

In [67]:
df_titanic = get_titanic_data()

In [70]:
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [59]:
df_telco = get_telco_data()

In [61]:
df_telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,contract_type_id,contract_type,internet_service_type_id,internet_service_type,customer_id,payment_type_id,monthly_charges,total_charges,payment_type_id,payment_type
0,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,1,Month-to-month,2,Fiber optic,0004-TLHLJ,1,73.90,280.85,1,Electronic check
1,0017-DINOC,Male,0,No,No,54,No,No phone service,1,Yes,...,3,Two year,1,DSL,0017-DINOC,4,45.20,2460.55,4,Credit card (automatic)
2,0019-GFNTW,Female,0,No,No,56,No,No phone service,1,Yes,...,3,Two year,1,DSL,0019-GFNTW,3,45.05,2560.1,3,Bank transfer (automatic)
3,0076-LVEPS,Male,0,No,Yes,29,No,No phone service,1,Yes,...,1,Month-to-month,1,DSL,0076-LVEPS,2,45.00,1242.45,2,Mailed check
4,0078-XZMHT,Male,0,Yes,No,72,Yes,Yes,1,No,...,3,Two year,1,DSL,0078-XZMHT,3,85.15,6316.2,3,Bank transfer (automatic)